org/2021/meditation-210117.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 沉思录210117

在代码行里使用 =$= 或者 =>=。有什么区别呢？

文件命名的规则是什么？如果不是技术文档，一定要写成英文吗？中文可以吗？

为什么 fork 过来的仓库，不能直接生成网页呢？非要是源仓库才行。具体的例子就是 [[https://github.com/tianheg/poetry-calendar][poetry-calendar]]

--------------

今天，父亲在我的面前哭了（他说自己在干活时从板凳上摔了下来，缓了好大会儿才恢复），我永远也不会忘记此般情境。我太幼稚，幼稚的我认为这个世界除了我的代码再无其它事物。可是，父亲的哭让我明白------自己要面对现实。我要解决自己的问题，关于现实世界的。我自己的理想世界可以不为外人所知晓。

我是单纯的，理想主义的。就像昨天看到一个人------他说自己时而现实时而理想主义。或许，我就处在他的这个阶段。

我总是想找一个图景，一个举一反三的路径。一个掌握了一个真理之后，可以应用于其他事情的。但是，这样的真理少之又少。我知道自己现在并没有找到。
