blog/2021/meditation-210117.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-06 Sun 15:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>沉思录 210117</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">沉思录 210117</h1>
</header><p>
在代码行里使用 <code>$</code> 或者 =&gt;=。有什么区别呢？
</p>

<p>
文件命名的规则是什么？如果不是技术文档，一定要写成英文吗？中文可以吗？
</p>

<p>
为什么 fork 过来的仓库，不能直接生成网页呢？非要是源仓库才行。具体的例子就是 <a href="https://github.com/tianheg/poetry-calendar">poetry-calendar</a>
</p>

<hr>

<p>
今天，父亲在我的面前哭了（他说自己在干活时从板凳上摔了下来，缓了好大会儿才恢复），我永远也不会忘记此般情境。我太幼稚，幼稚的我认为这个世界除了我的代码再无其它事物。可是，父亲的哭让我明白-&#x2013;&#x2014;自己要面对现实。我要解决自己的问题，关于现实世界的。我自己的理想世界可以不为外人所知晓。
</p>

<p>
我是单纯的，理想主义的。就像昨天看到一个人-&#x2013;&#x2014;他说自己时而现实时而理想主义。或许，我就处在他的这个阶段。
</p>

<p>
我总是想找一个图景，一个举一反三的路径。一个掌握了一个真理之后，可以应用于其他事情的。但是，这样的真理少之又少。我知道自己现在并没有找到。
</p>
</div>
</body>
</html>